Repository: kazbeksultanov/weather_app
Catalog: packages/localization/lib/l10n/intl_*.arb
Languages: ru

source: Turn off
ru: Выключить

source: Turn on
ru: Включить
