Repository: kazbeksultanov/weather_app
Catalog: packages/localization/lib/l10n/intl_*.arb
Languages: ru

source: Server request error
ru: Ошибка запроса сервера

source: Error
ru: Ошибка

source: Action canceled
ru: Действие отменено

# cities
source: Сities
ru: Города

source: Search cities
ru: Поиск городов

source: Start entering city name
ru: Начните вводить название города

# noSelectedCitiesYet
source: No selected cities yet. Select from search page
ru: Пока нет выбранных городов. Выберите из страницы поиска

# repeatPinCode
source: Confirm PIN-code
ru: Повторите PIN-код

# alreadyHaveWallet
source: I already have a wallet
ru: У меня уже есть кошелёк

# createWallet
source: Create a wallet
ru: Создать кошелёк

# onboarding1Underline
source: Private keys
ru: Приватные ключи

# onboarding1
source: that will never leave your device
ru: , которые никогда не покинут ваше устройство

# onboarding2Underline
source: Safe storage of
ru: Безопасное хранение

# onboarding2
source: all cryptocurrency in one place
ru: всей криптовалюты в одном месте

# onboarding3Underline
source: Fast and anonymous exchange
ru: Быстрый и анонимный обмен

# onboarding3
source: of cryptocurrencies
ru: криптовалюты

# onboarding4Underline
source: Earn, spend and trade
ru: Зарабатывайте, тратьте и торгуйте

# onboarding4
source: with access to decentralized applications
ru: с доступом к децентрализованным приложениям

# legal
source: Legal information
ru: Правовая информация

# legalHint
source: To create a wallet, you must read the Terms of Service and Privacy Policy
ru: Для создания кошелька необходимо ознакомиться с Условиями обслуживания и Политикой конфиденциальности

source: Privacy policy
ru: Политика конфиденциальности

# termsOfUse
source: Terms of Service
ru: Условия обслуживания

# haveReadLegal
source: I have read and accept the Terms of Service and Privacy Policy
ru: Я прочитал и принимаю Условия обслуживания и Политику конфиденциальности

# continueText
source: Continue
ru: Продолжить

source: Next
ru: Далее

# backupCopy
source: Back up your wallet
ru: Резервная копия вашего кошелька

# backupCopyHint
source: You will now see 12 words that will allow you to regain access to your wallet. Be prepared to keep your secret phrase in a safe place.
ru: Сейчас вы увидите 12 слов, которые позволят вам восстановить доступ к кошельку. Будьте готовы сохранить секретную фразу в безопасном месте.

# backupCopyAgree
source: I understand that if I lose the secret phrase, then I will not be able to restore access to my wallet
ru: Я понимаю, что если потеряю секретную фразу, то не смогу восстановить доступ к своему кошельку

# generateMnemonic
source: Generate words
ru: Сгенерировать слова

source: Generate QR code
ru: Сгенерировать QR-code

source: Your secret phrase
ru: Ваша секретная фраза

# secretPhraseHint
source: Write down and keep these words in the correct order. Store it securely and do not pass it on to anyone.
ru: Запишите и сохраните эти слова в правильном порядке. Храните фразу в надежном месте и никому ее не передавайте.

source: Copy phrase
ru: Скопировать фразу

source: Show QR code
ru: Показать QR-код

# haveSecurelySavedPhrase
source: I have securely saved the phrase
ru: Я надежно сохранил фразу

# verifyPhrase
source: Verify your recovery phrase
ru: Подтвердите фразу восстановления

# verifyPhraseHint
source: Click on the words in the correct order to create a wallet.
ru: Нажимайте на слова в правильном порядке, чтобы создать кошелёк.

# verify
source: Confirm
ru: Подтвердить

source: Current balance
ru: Текущий баланс

source: Try again
ru: Попробуйте снова

source: Error details
ru: Подробнее об ошибке

# mnemonicHasCopied
source: Mnemonic is copied to clipboard
ru: Фраза скопирована в буфер обмена

source: QR code
ru: QR-код

# mnemonicQrCodeHint
source: This QR code contains your secret phrase. Store it securely and do not pass it on to anyone.
ru: В этом QR-коде содержится ваша секретная фраза. Сохраните код в надежном месте и никому его не передавайте.

# excellent
source: Perfectly!
ru: Отлично!

# transfer
source: Send
ru: Отправить

source: Receive
ru: Получить

source: Copy
ru: Скопировать

source: Transactions
ru: Транзакции

# noTransactions
source: Your future transactions will be displayed here
ru: Здесь будут отображаться ваши будущие транзакции

# successfullyCopied
source: Copied successfully
ru: Адрес скопирован

# setAmount
source: Specify the amount
ru: Укажите сумму

# share
source: Share this
ru: Поделиться

source: Request currency
ru: Запросить валюту

# requestMoneyType
source: Request {currency}
ru: Запросить {currency}

# enterAmount
source: Enter the amount
ru: Введите сумму

# transferCurrency
source: Request currency
ru: Запросить валюту

source: Paste
ru: Вставить

# verifyTransactionPageTile
source: Verify
ru: Подтвердить

source: Sender address
ru: Адрес отправителя

# recipientAddress
source: Recipient's address
ru: Адрес получателя

source: Network fee
ru: Комиссия за транзакцию в сети

# sendMoney
source: Send {total}
ru: Отправить {total}

source: Settings
ru: Настройки

source: Wallet
ru: Кошелёк

source: Wallets
ru: Кошельки

# security
source: Safety
ru: Безопасность

# availableBalance
source: On balance now
ru: Сейчас на балансе

source: PIN-code
ru: PIN-код

source: Password
ru: Пароль

# biometric
source: Biometrics
ru: Биометрия

# autoBlocking
source: Automatic blocking
ru: Автоматическая блокировка

# autoBlockingInstant
source: Immediately
ru: Немедленно

# autoBlockingIn1Minute
source: After 1 minute
ru: Через 1 минуту

# autoBlockingIn5Minutes
source: After 5 minutes
ru: Через 5 минут

# autoBlockingIn1Hour
source: After 1 hour
ru: Через 1 час

# autoBlockingIn5Hour
source: After 5 hours
ru: Через 5 часов

# createPinCode
source: Come up with a code
ru: Придумайте код

# enterPinCode
source: Enter the code
ru: Введите код

source: to access the application
ru: для доступа к приложению

source: to unlock
ru: для разблокировки

source: Create password
ru: Придумайте пароль

source: Repeat password
ru: Повторите пароль

source: enter password again
ru: введите пароль еще раз

source: enter password
ru: Введите пароль

source: Set password
ru: Задайте пароль

# submit
source: Send
ru: Отправить

source: Add token
ru: Добавить токен

source: Add new token
ru: Добавить новый токен

# searchInputTitle
source: Search...
ru: Поиск...

# networkTokenType
source: Network type
ru: Тип сети

source: Select network
ru: Выберите сеть

source: Name
ru: Имя

source: Contract address
ru: Адрес контракта

source: Symbol
ru: Символ

# notFound
source: Nothing is found
ru: Ничего не найдено

source: Unexpected error
ru: Непредвиденная ошибка

# feeOutOfRange
source: Fee out of range: {min} - {max}
ru: Необходимо ввести сумму от {min} до {max}

# insufficientBalance
source: Insufficient funds on the balance sheet
ru: Недостаточно средств на балансе

# insufficientBalanceButtonTitle
source: Insufficient funds
ru: Недостаточно средств

# cancelled
source: Canceled
ru: Действие отменено

source: Save
ru: Сохранить

source: Delete
ru: Удалить

# selectWallet
source: Select a wallet
ru: Выбрать кошелёк

# selectWalletError
source: Failed to select wallet
ru: Не удалось выбрать кошелек

source: Show secret phrase
ru: Показать секретную фразу

# selectWalletSuccess
source: Wallet selected successfully
ru: Кошелёк успешно выбран

source: Incoming transaction
ru: Входящая транзакция

source: Pending transaction
ru: Ожидающая транзакция

source: Outgoing transaction
ru: Исходящая транзакция

# confirmation
source: Confirmations
ru: Подтверждения

source: Transaction time
ru: Время транзакции

source: Transaction hash
ru: Хэш транзакции

# failedTransaction
source: Unsuccessful transaction
ru: Неудачная транзакция

source: Transaction status
ru: Статус транзакции

# successTransaction
source: Successful
ru: Успешно

# inProgressTransaction
source: In progress
ru: Выполняется

source: Share transaction
ru: Поделиться транзакцией

source: Transaction details
ru: Детали транзакции

# invalidMnemonic
source: The entered mnemonic phrase is not valid. Try again
ru: Вы неверно ввели фразу. Попробуйте снова.

# passwordValidityToRules
source: The password must meet the conditions:
ru: Пароль должен содержать:

# symbolsNotUse
source: symbols are not used (brackets, punctuation, etc.)
ru: символы не используются ( скобки, знаки препинания и т.д.)

# onlyLatinLetter
source: only latin letters
ru: только латинские буквы

# minOneUppercaseLetter
source: min. 1 capital letter
ru: мин. 1 заглавная буква

# minOneLowercaseLetter
source: min. 1 spelling letter
ru: мин. 1 прописная буква

# minOneDigit
source: min 1 digit
ru: мин. 1 цифра

source: min. 6 characters
ru: мин. 6 знаков

# invalidAddress
source: Invalid address for this network
ru: Невалидный адрес для этой сети

# walletAlreadyExists
source: The wallet already exists
ru: Кошелёк уже существует

source: Wallet with this name already exists
ru: Кошелёк c этим именем уже существует

# errorAddingNewToken
source: Error adding token
ru: Ошибка добавления токена

source: Multi Coin Wallet
ru: Мультимонетный кошелёк

source: Import
ru: Импортировать

source: What is a secret phrase?
ru: Что такое секретная фраза?

source: Secret phrase
ru: Секретная фраза

# aboutSecretPhrase
source: Usually 12 (sometimes 24) words separated by one space
ru: Обычно 12 (иногда 24) слов, разделенных пробелом

source: CryptoCardWallet
ru: CryptoCardWallet кошелёк

# addressCopied
source: Address copied successfully
ru: Адрес успешно скопирован

# hashCopied
source: Hash copied successfully
ru: Хэш успешно скопирован

# assetAdded
source: Currency added successfully
ru: Валюта успешно добавлена

# importWalletStandardName
source: Multi-coin wallet
ru: Мультимонетный кошелёк

source: Success
ru: Успешно

source: OK
ru: ОК

source: DEMO
ru: ДЕМО

source: Oh no!
ru: Что-то пошло не так :(

source: Invalid value
ru: Неверное значение

# passwordNotMatch
source: Password code doesn't match
ru: Пароли не совпадают

# pinNotMatch
source: PIN-code doesn't match
ru: PIN-код не совпадает

# enableCameraPermission
source: Please enable camera permission
ru: Пожалуйста, включите разрешение на доступ к камере

source: Failed to load session
ru: Не удалось загрузить сессию

source: Connection error
ru: Ошибка соединения

source: None
ru: Отсутствует

source: Fingerprint
ru: Отпечаток пальца

source: Invalid PIN-code
ru: Неверный PIN-код

source: Invalid password
ru: Неверный пароль

# invalidBiometric
source: Invalid biometrics
ru: Неверная биометрия

source: Currency not found
ru: Валюта не найдена

# failedGenerateWallet
source: Failed to generate new wallet
ru: Не удалось создать кошелёк

# failedLoadingWalletState
source: Failed to load wallet state
ru: Не удалось создать кошелёк

# noInternetError
source: No internet connection
ru: Отсутствует подключение к сети Интернет

source: No connection to our servers
ru: Нет подключения к нашим серверам

# notAuthError
source: User is not authorized
ru: Пользователь не авторизован

source: Invalid asset state
ru: Невалидное состояние ассета

# noContractInGivenToken
source: No contract in this token
ru: В данном токене отсуствует контракт

# successfullyPushedTransaction
source: Transaction successfully sent
ru: Транзакция успешно отправлена

# openWallet
source: Open a cryptocurrency wallet
ru: Откройте криптовалютный кошелёк

source: KeyWallet wallet
ru: KeyWallet кошелёк

# orderEnterKeyWallet
source: Order or connect your KeyWallet
ru: Закажите или подключите свой KeyWallet

# createOrOrderBankCard
source: Order or connect a bank card
ru: Закажите или подключите банковскую карту

# getReadyKeyWallet
source: Prepare a KeyWallet card to activate it and create a wallet. If you don't have a wallet, order it using the link below.
ru: Приготовьте карту KeyWallet для её активации и создания кошелька. Если у вас нет карты - закажите её на сайте.

source: Order KeyWallet
ru: Заказать KeyWallet

source: Activate KeyWallet
ru: Активировать KeyWallet

source: Start verification
ru: Начать верификацию

# bringKeyWallet
source: Bring KeyWallet to your phone
ru: Поднесите KeyWallet к телефону

# bringKeyWalletLong
source: Bring KeyWallet to the top of your phone. Do not remove the card until verification is complete.
ru: Поднесите KeyWallet к верхней части вашего телефона. Не убирайте карту до завершения верификации.

# setPinCode
source: Setting the PIN Code
ru: Установка PIN-кода

# setPinCodeRecommendation
source: For your safety, we recommend setting a PIN to your KeyWallet. If you lose access to KeyWallet, we will ask for this code.
ru: Для вашей безопасности мы рекомендуем установить PIN-код на KeyWallet. Если вы потеряете доступ к Key Wallet мы запросим этот код.

# continueWithOutPinCode
source: Continue without PIN
ru: Продолжить без PIN-кода

source: Go back
ru: Вернуться

# changePin
source: Change PIN-code
ru: Сменить PIN-код

# viewCardData
source: View card details
ru: Просмотреть данные о карте

source: Add KeyWallet card
ru: Привязать KeyWallet карту

source: Remove KeyWallet card
ru: Отвязать KeyWallet карту

# keyWalletCardData
source: KeyWallet card information
ru: Информация о KeyWallet карте

# cardIdLabel
source: Card Id
ru: Идентификатор карты

# cardPublicKeyLabel
source: Card public key
ru: Публичный ключ карты

# cardStatusLabel
source: Card status
ru: Состояние KeyWallet карты

# walletPublicKeyLabel
source: Wallet public key
ru: Публичный ключ кошелька

# keyWalletPinChangedSuccessfullyChanged
source: KeyWallet PIN-code successfully changed
ru: Pin-код KeyWallet карты успешно изменён

source: KeyWallet card already added
ru: KeyWallet карта уже добавлена

source: KeyWallet card not added yet
ru: KeyWallet карта ещё не добавлена

source: Advanced BTC
ru: Расширенная конфигурация BTC

# advancedSettings
source: Settings
ru: Конфигурации

# maxFeeSat
source: MAX fee (satoshi/byte):
ru: Макс. комиссия (сатоши/байт):

# minFeeSat
source: MIN fee (satoshi/byte):
ru: Мин. комиссия (сатоши/байт):

# sizeOfFeeSat
source: Size of fee (satoshi/byte)
ru: Размер комиссии (сатоши/байт)

# transactionHint
source: Lowering the price might cause transaction to get delayed or cancelled
ru: Снижение цены может привести к задержке или отмене транзакции

# gasPrice
source: Gas Price (Gwei)
ru: Цена Газа (Gwei)

source: Gas Limit
ru: Лимит Газа

source: KeyWallet wallets
ru: KeyWallet кошельки

source: KeyWallet settings
ru: Настройки KeyWallet

source: KeyWallet actions
ru: Действия с KeyWallet картой

source: No wallets
ru: Кошельков нет

source: NFC is disable
ru: NFC выключен

# notEnoughUtxo
source: Not enough UTXO for the current transaction
ru: Недостаточно UTXO для текущей транзакции

source: Total balance
ru: Общий баланс

# walletDeleteSuccessfully
source: Wallet deleted successfully
ru: Кошелёк успешно удалён

source: Import wallet
ru: Импортировать кошелёк

source: Create wallet ways
ru: Способы создания кошелька

# validationRequiredError
source: This field is required
ru: Данное поле является обязательным

# validationDecimalError
source: Should be a valid number
ru: Должен быть действительный номер

# validationOnlyDigitsError
source: The value cannot be zero
ru: Значение не может быть равным нулю

# validationNonNegativeNumberError
source: Only positive numbers are allowed
ru: Допускается использовать только положительные числа

# validationNonZeroNumberError
source: Can't be zero
ru: Значение не может быть равным нулю

# validationMinLengthError
source: Field should have at least {length} characters
ru: В строке должно быть {length} символов

# validationExactLengthError
source: Length should be equal to {length}
ru: В строке должно быть не менее {length} символов

# validationWordCountError
source: Field should have at least {length} words
ru: В строке должно быть не менее {length} слов

# validationLatinLowerCaseError
source: Only Latin lowercase are accepted
ru: Допускаются только латинские строчные буквы

# validationPasswordError
source: Password must contain at least 6 characters, including: at least one uppercase and lowercase latin letter and number
ru: Пароль должен содержать не менее 6 символов, в том числе: как минимум одну заглавную и строчную латинскую букву и цифру.

# keyWalletMethodNotFoundError
source: KeyWallet method not found
ru: Метод KeyWallet не найден

source: close
ru: закрыть

# thisWalletAlreadyExist
source: This wallet has already been imported
ru: Этот кошелёк уже импортирован

# notEnoughResourcesForTransaction
source: Insufficient funds for commission
ru: Недостаточно средств для комиссии

source: Wallet name changed
ru: Имя кошелька изменено

source: Currencies not added yet
ru: Валюты ещё не добавлены

# openSetting
source: Open settings
ru: Открыть настройки

# openSettingToEnableCamera
source: Camera permission denied completely. You need to give permission in the settings. Open settings?
ru: Разрешение на камеру полностью отклонено. Нужно дать разрешение в настройках. Открыть настройки?

source: Yes
ru: Да

source: No
ru: Нет

source: Transaction speed
ru: Скорость транзакции

# minutesShort
source: min
ru: мин.

# hourShort
source: h
ru: ч.

# satoshiPerByte
source: sat/byte
ru: сатоши/байт

# avgConfirmationTime
source: Average confirmation time
ru: Среднее время подтверждения

# highForTransactionSpeed
source: High
ru: Высокая

# middleForTransactionSpeed
source: Middle
ru: Средняя

# lowForTransactionSpeed
source: Low
ru: Низкая

# customForTransaction
source: Custom
ru: Индивидуальная

# enterFee
source: Enter fee in sat/byte
ru: Введите комиссию в сатоши/байт

# fromTotalAmount
source: of the total
ru: от общей суммы

# assetWithSymbolNotFound
source: Asset with symbol {symbol} not found
ru: Ассет с символом {symbol} не нейден

source: Hide
ru: Скрыть

source: Networks
ru: Сети

source: Other networks
ru: Другие сети

# sureToChangeNetwork
source: Are you sure you want to switch network?
ru: Вы уверены, что хотите переключить сеть?

source: switch to
ru: переключить на

source: Back
ru: Назад

# walletConnectInfoText
source: Connect your wallet to WalletConnect to make transactions
ru: Подключите свой кошелек к WalletConnect для совершения транзакций

source: Information
ru: Информация

# walletConnectInfo
source: WalletConnect is an open source protocol that allows you to connect your mobile wallet to decentralized applications (dApps) using a QR code. Remember to disconnect when you're done with dApps for security reasons.
ru: WalletConnect — это протокол с открытым исходным кодом, который позволяет подключить мобильный кошелек к децентрализованным приложениям (dApps) с помощью QR-кода. Помните о необходимости отключаться по окончании работы с dApps из соображений безопасности.

source: New connection
ru: Новое подключение

# activeSessionWillBeHere
source: Active connections will appear here
ru: Активные соединения появятся здесь

# wantsToConnect
source: wants to connect your wallet
ru: хочет подключится к вашему кошельку

# walletConnectText1
source: View wallet balance and activity
ru: Просмотр баланса и активности кошелька

# walletConnectText2
source: Request for approval of transactions
ru: Запрос на одобрения транзакций

source: Connect
ru: Подключиться

source: Reject
ru: Отклонить

source: Connected
ru: Подключен

source: Address
ru: Адрес

source: Disconnect
ru: Отключить

source: Smart Contract Call
ru: Вызов Смарт Контракта

source: Active
ru: Актив

source: From
ru: От

# networkFeeWc
source: Network Fee
ru: Сетевой сбор

source: Max Total
ru: Макс Тотал

# wcWarningText
source: Make sure you trust this site. By interacting with it, you authorize this site to access your funds
ru: Убедитесь что вы доверяете этому сайту. Взаимодействуя с ним, вы разрешаете этому сайту получить доступ к вашим средствам

# wcAddressChange
source: Addresses of active sessions on WalletConnect will be changed in the following DApps:
ru: Адреса в активных сессиях по WalletConnect будут изменены в следующих DApp:

source: Transaction data
ru: Данные транзакции

source: Data to sign
ru: Данные для подписания

source: Session was disconnected
ru: Сессия была разъединена

# connectedTo
source: Connected to {dAppUrl}
ru: Подключен к {dAppUrl}

# trc10TokenRequires7Digits
source: Token TRC10 requires exactly 7 digit contract address
ru: Адрес контракта TRC10 должен состоять из 7-значного цифрового значения

# trc20TokenRequires34stringLength
source: Token TRC20 requires exactly 34 character contract address
ru: Адрес контракта TRC20 должен состоять из 34-значного значения

source: Token already added
ru: Токен уже добавлен

source: Tron network prohibits transactions to yourself
ru: Сеть Tron запрещает транзакции самому себе

# unknownTronNodeError
source: Unexpected error. Try to complete the transaction later. Server message: ${message}
ru: Непредвиденная ошибка. Попробуйте провести транзакцию позже. Сообщение с сервера: ${message}

# transactionTimeExpired
source: Transaction time has expired. Try again.
ru: Время транзакции истекло. Попробуйте еще раз.

# contractValidationFailed
source: Contract not found
ru: Контракт не найден

source: Native coin
ru: Нативная монета

# decimalValidatorError
source: This token can not have more than {decimal} decimal(s)
ru: Этот токен не может иметь больше, чем {decimal} десятичных знаков.

# contractAddressCopiedWarning
source: You have copied a contract address. Any token sent to this address will be lost.
ru: Вы скопировали адрес смарт-контракта. Любой токен, отправленный на этот адрес, будет потерян.

# notEnoughTrxToCompleteTransaction
source: Not enough TRX to complete the transaction
ru: Недостаточно TRX для проведения транзакции

# cryptoCardWallets
source: CryptoCardWallet wallets
ru: CryptoCardWallet кошельки

# firstTimeGeneratingAddressForCryptoCardWalletForThisAddress
source: First time generating an address for this token. We need to scan CrytoCardWallet card of this wallet!
ru: Первая генерация адреса для этого токена. Нам нужно отсканировать карту CrytoCardWallet этого кошелька!

source: Cancel
ru: Отменить

source: Wallet name can not be space
ru: Имя кошелька не может быть пробелом

# noTokenForSwapException
source: You do not have tokens for swap
ru: У вас нет токенов для свопа

source: Version:
ru: Версия:

source: Buy
ru: Купить

# amountRecalculated
source: Amount without commission. Final amount on the verification page
ru: Сумма без учета комиссии. Конечная сумма на странице верификации

source: Send max
ru: Отправить макс.

# dAppNotSupportAutoSelectNetwork
source: does not support automatic network selection, please select a network
ru: не поддерживает автоматичекский выбор сети, пожалуйста выберите сеть

source: Currencies
ru: Валюты

# tooSmallDustValueForTransactionException
source: Too small "dust" value for transaction. Try to increase value
ru: Слишком маленькое значение "dust" для проведения транзакции. Попробуйте увеличить значение

# feeCanNotExceed1EthValueForTransactionException
source: Fee can not exceed max value of 1 unit. Try to change gas price
ru: Комиссия не может превышать максимального значения 1. Попробуйте изменить цену на газ

# feeHigherThanAmount
source: Fee is higher than total available amount {amountMax}
ru: Комиссия выше общей доступной суммы {amountMax}

# nonceTooLowTransactionException
source: Nonce value is too low
ru: Значение nonce слишком низкое

source: Advanced info
ru: Расширенная информация

source: Nonce copied
ru: Nonce скопирован

source: Raw transaction hex copied
ru: Raw transaction hex скопирован

source: No available wallets
ru: Нет доступных кошельков

source: Select wallet type
ru: Выберите тип кошелька

# otherWalletTypes
source: Available wallets
ru: Доступные кошельки

# pinCodeEnter
source: Enter by PIN
ru: Войти по PIN

source: Authorization
ru: Авторизация

# checkWalletType
source: Be sure that the wallet type is correct
ru: Перед подключением убедитесь, что тип кошелька выбран верно
